// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// 2023-06-22
// 12:09:45
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#include   "MC50.h"




/*------------------------------------------------------------------------------
 Сброс системы
 ------------------------------------------------------------------------------*/
void Reset_system(void)
{
  __disable_interrupt();
  // System Control Block -> Application Interrupt and Reset Control Register
  *(uint32_t *)(0xE000ED0C)= 0x05FA0000 // Обязательный шаблон при записи в  регистр SCB_AIRCR
                            | BIT(2);  // Установка бита SYSRESETREQ
  for (;;)
  {
    __no_operation();
  }
}


